In [54]:
import tensorflow as tf
import pandas as pd
import tensorflow.keras as layers
import numpy as np

In [66]:
input_data = pd.read_csv("train.csv")

def set_age(name):
    if(name.find('Mr.') != -1): #male - married or not
        return 30
    elif(name.find('Mrs.') != -1): #female - married
        return 45
    elif(name.find('Ms.') != -1): #female - married or not 
        return 30
    elif(name.find('Miss.') != -1): #female - not married 
        return 20
    else:
        return 45

def clean_dataset(dataset):
    popular_port = dataset['Embarked'].dropna().mode()[0] 
    print("This port is most popular and replace all 'NA' to " + popular_port)
    dataset['Embarked'] = dataset['Embarked'].fillna(popular_port)
    dataset['Companions'] = dataset['SibSp'] + dataset['Parch'] #number of people travelling with
    dataset['Sex'] = dataset['Sex'].map( {'female': 1, 'male': 0} ).astype(int)
    embarked_one_hot = pd.get_dummies(dataset['Embarked'], prefix='Embarked')
    dataset = dataset.join(embarked_one_hot)
    dataset['Age'] = dataset.apply(
                            lambda row: set_age(row['Name']) if np.isnan(row['Age']) else row['Age'], axis=1)
    
    dataset = dataset.drop(['PassengerId','Cabin', 'Ticket', 'Name', 'SibSp', 'Parch', 'Embarked'], axis=1) #drop useless columns
    return(dataset)
    
    
train_data = clean_dataset(input_data)
train_data

This port is most popular and replace all 'NA' to S

,Survived,Pclass,Sex,Age,Fare,Companions,Embarked_C,Embarked_Q,Embarked_S
0,0,3,0,22.0,7.2500,1,0,0,1
1,1,1,1,38.0,71.2833,1,1,0,0
2,1,3,1,26.0,7.9250,0,0,0,1
3,1,1,1,35.0,53.1000,1,0,0,1
4,0,3,0,35.0,8.0500,0,0,0,1
...,...,...,...,...,...,...,...,...,...
886,0,2,0,27.0,13.0000,0,0,0,1
887,1,1,1,19.0,30.0000,0,0,0,1
888,0,3,1,20.0,23.4500,3,0,0,1
889,1,1,0,26.0,30.0000,0,1,0,0
890,0,3,0,32.0,7.7500,0,0,1,0